<template>
  <div>
    <div class="border">
      <div class="title">
        隐私权政策
        <img style="width:25px;margin-right:10px;float:right" @click="closeDialog" src="../imgs/close.png"/>
      </div>
      <div class="contentOut" ref="contentMain">
        <div class="content">
          <h4>1. 总论</h4>
          <p>我们尊重并致力于保护您的隐私权。本隐私权声明意在解释我们对在线客户信息的政策及实践做法。本说明将告知您我们会如何收集、使用并保护我们主动收集的或由您通过本网站向我们提供的个人及其他信息，通过这一方式我们希望能为提供一定程度的安心及信心。使用本网站的行为即表示您同意本隐私声明的条款，请在阅读并同意本条款情况下继续使用本网站。</p>
          <h4>2. 我们组织机构、网站和一般信息搜集措施的介绍：</h4>
          <div class="tip">在线数据追踪</div>
          <p>当您对我方网站进行访问时，您的跨数字平台的活动信息也可能根据您的在线活动时间被相关合作方所搜集，如第三方广告合作机构和分析服务机构。这类信息可能允许第三方向您的设备发送定向广告。想了解更多有关第三方广告机构对于这类数据的搜集和兴趣定位广告的使用情况（和拒绝此类使用的方式），请参看第7项内“兴趣定位广告”相关内容。
大部分浏览器可设置禁止cookie，但这可能会影响到我们网站为您提供的一些功能或服务。
更多资讯请参看第5项和第7项内容。</p>
          <h4>3. 我们向您收集的个人身份信息：</h4>
          <p>当您访问本网站，除非您自愿提供，我们不会向您收集任何个人身份信息。

个人数据信息包括你的姓名、地址、电话号码以及电子邮件地址等关于您的某些特定信息。如果您选择不向我们提供个人信息，您仍旧可以访问我们的网站，但您可能无法收到某些产品信息或得到相关服务。

在您访问我方网站时，我们搜集您的个人身份信息的主要目的是为了通过网站特性来为您提供相关功能和服务，从而使您得到有意义的个性化体验。

我们网站可能通过session或连续cookies来搜集个人身份信息以确认您的登陆身份，也可能与第三方广告伙伴来实现网站功能。若想了解相关内容和工作模式，请参看7项“信息搜集方式”。</p>
          <h4>4. 我们如何使用您的个人身份信息：</h4>
          <p>我们可能会将您的个人身份信息作以下用途：

网站用户申请（如：创建个人登录凭据、手册，发送包含电子邮件或其他信息的市场或促销资讯，折扣服务、报价，与林肯代表交流内容的保存或共享）；
回应您的留言或信息需求；
满足您的要求或发展新的产品或服务；
加强顾客至上的用户体验；
开发新型和改进的产品、服务和市场；
根据产品或服务订单的物流状态与您取得联系；
为改进我们网站的格局、内容、产品和服务进行网站分析；
编译我方公司数据库存储的用户信息；
将本网站搜集的关于您的个人信息与其他来源相关信息进行配对；
遵循法律条款。</p>
          <h4>5. 我们向网站访问者收集的其他（非个人身份）信息：</h4>
          <p>林肯网站也对网站访问者搜集其他“非个人身份信息”。

当用户采用一般形式访问我们的网站时，我们并不收集您的个人身份信息，而是对全部访问者进行汇总和匿名的信息搜集。本网站上的所有信息无需您提供个人身份信息即可随意并免费浏览。

我们向网站访问者收集的非个人身份信息：
- 您的互联网服务商名称
- 您从何网站链结至本网站
- 您浏览了哪些网页以及浏览时间

当您访问相关手机网站或通过扫描二维码来访问本网站时，我们会搜集其他非个人身份信息，如您访问站点所使用的手机型号、操作系统和服务供应商。

若您在浏览手机网站同时开启了手机（若有）的GPS功能的话，您可在网站上使用同样的定位功能从而调用您的GPS数据来确认您的位置并提供定位服务。

我们从您处收集这些信息的主要目的是为了进行数据分析以协助我们改进本网站的各项功能。

我们可能通过session或持续cookies、session标签、网络信标/GIF/像素标签、网站横幅广告或链接、邮件第三方提供的用户请求邮件（如：第三方电子邮件服务商提供的用户定制进行朋友分享的电子邮件），以及第三方提供的页面点击追踪工具（如Adobe和谷歌分析系统，这些公司也可能使用此类工具）来搜集网站访问者的非个人身份信息。若想了解相关内容和工作模式，请参看7项“信息搜集方式”。</p>

          <h4>6. 非个人信息的分享及处理：</h4>
          <p>我们可能会将您的非个人身份信息作以下用途：

整合统计数据来帮助网站设计和确认公共特性；
测试网站表现以帮助我们更新和改进站点来实现用户需求；
根据您已访问的页面和浏览的醒目来为提供您所感兴趣的内容；
加强顾客至上的用户体验；
开发新型和改进的产品、服务和市场；

本网站汇总非个人身份信息的目的是为了对网站访问者的用户体验进行分析：

这是在汇总层面进行的分析，不涉及您的个人信息；
可能会有我们的第三方合作伙伴参与；
可能会与第三方通过跨设备网站和应用所搜集的信息整合；
为改进我们网站和用户体验；
可能会使用session和/或持续cookies来追踪用户在

在本网站和其他福特公司网站的行为或活动</p>

          <h4>7. 信息搜集方式：</h4>
          <p>“cookie”是一个小文本文件，它可以在许多方面协助您在我们网站时上进行更愉悦和有意义的访问。例如，当您回访我们某一网站时，在cookie协助下您无需每次都重新登陆。我们也可通过它们来提供更好地切合您兴趣倾向的页面内容或广告。以下介绍了几种不同类型的cookie。

“session”cookie：仅存储在您电脑的工作记忆区（RAM）内，且仅存在您浏览活动期间。当您退出所有浏览器窗口或关闭您的电脑时，session cookie就永远消除了。

持续cookie：它们可定期存储在您的硬盘空间上，这段时间可以从现在到明天或下周甚至十年后。持续cookie会驻留在您的电脑上直至 a）自身过期，b）被其他新cookie重写，或c）您手动移除它们。大部分浏览器可通过设置禁止cookie，但此类设置可能会影响到您使用部分网站功能或特色服务。

当您访问我们网站时站点可能生成session日志，我们通过session日志来了解人们在我们网站上的浏览活动。这样一来我们就可以相应设置页面从而使访问最多的内容更容易被找到。通过追踪页面访问信息，我们还可了解我们所提供的内容是否有用。这里搜集的数据仅仅是您的IP地址（网络协议地址）、引导您来此的网页、您所访问的页面以及进行相关访问的日期和时间信息。

用户可能通过横幅广告或其他站点链接导向到本网站。林肯网站上的横幅广告或链接会通过cookie或站点信标来传输关于这些广告或链接有效性的数据。它们不会搜集用户的个人身份信息。

用户可能通过横幅广告、其他站点链接或二维码导向到本网站。广告、链接或二维码可能通过cookie或网络信标工具来传输关于这些广告或链接有效性的数据。它们不会搜集用户的个人身份信息。

兴趣定向/在线行为广告

兴趣定向广告：在我们网站的一些网页上，我们可能允许第三方广告合作伙伴通过设置网页追踪工具（如cookies、网络信标）以根据您在这些页面上的活动（如您的IP地址、已访页面、日期时间）来搜集匿名的非个人定向信息。我们也可能将这些匿名非个人定向信息与第三方广告合作伙伴共享。当您在他方网络环境内和他们的（非福特）网站、手机应用程序或数字服务互动时，我们的广告合作伙伴可能使用这些信息（并结合通过其他网站、应用程序或其他数字服务得到的信息）向您发送未来针对性广告。这项业务一般归类为“兴趣定向广告”。

不参与其他数字服务商的兴趣定向广告：使用其他数字服务的用户（如一般或有线电视）可能通过相关数字服务供应商选择不参与兴趣定向广告。我们建议您查看您数字服务供应商的隐私政策来判断他们是否建议此项服务以及如何提供否决权。</p>

          <h4>8. 个人信息的分享及处理：</h4>
          <p>除非您自行选择，否则本网站不会对您的个人身份信息进行分享、出售或出租。

当您创建账户时，您可能同时享有以同一账号（Email地址）登陆一个或多个福特公司或分支机构网站的特权，同时您也可以选择注册新的账号。

您在使用本网站功能时所提供的个人信息可能被存储于一个或多个本公司所属的数据库中，它们仅会被用于与营销计划、市场活动或关于本网站产品或服务相关的通讯目的。

我们可能会与福特家族内部的其他公司或分支机构及相关服务提供商分享所收集到的个人信息。我们的“家族公司”是指与我们同享控制及所有权的集团内部的企业。我们在“家族”内部分享信息是为正常开展业务并向消费者提供产品及服务的需要。“服务提供商”包括授权供应商、服务提供商及合作伙伴等。

我们会和供应商、承包商或合作伙伴在一般业务流程中分享获取的用户个人身份信息。我们的供应商、承包商或合作伙伴除了进行和我方协议内的网站服务外，不得出于其他任何目的使用所获取的您的个人身份信息。

本网站数据可能和福特公司网站或其下属或分支站点共享。</p>

          <h4>9. 您的信息安全:</h4>
          <p>本网站访问者的信息安全维护对我们来说十分重要。我们使用系统、政策以及流程来确保信息的准确性并防止信息流失、被滥用或者篡改。

您提交个人身份信息时如电子邮件或电话号码时，我们会使用数字技术如“安全套接层”（SSL）或“传输安全层”（TLS）来保护您的数据。SSL和TLS均为加密技术，可保护您的个人身份信息免遭未经授权的个人滥用。

我们与之合作的供应商、经销商、承包商或合作伙伴在为网站提供服务的过程中一旦获取您的个人身份信息，他们也必须按要求保密相关信息。

除了进行和我方协议内的网站服务外，供应商不得出于其他任何目的使用这些信息。</p>

          <h4>10. 个人信息的传输：</h4>
          <p>当您访问本网站并向我们提供您的个人身份信息时，您理解并同意我们可以根据本隐私权政策的约定在全球范围内（其中包括美国）在福特集团或相关服务提供商内部收集、使用、处理、转移并披露您的个人身份信息。因此，当您访问本网站并提供这些信息代表您同意该信息可跨境转移，在全球各地使用、处理或披露该信息。您的同意，应视为包括同意将个人身份信息或非个人身份识别信息转让至与自己的国家相比可能有不同程度隐私保护的区域。</p>
          <h4>11. 与其他网站的链接：</h4>
          <p class="last-p-padding">本网站中可能会包含与其他网站的链接。我们建议您查看所访问网站的隐私政策，包括我方网站链接指向的网站，了解此等网站如何收集、使用和分享您的信息。我们不为其他网站的隐私政策、内容或数据处理方法负责。

本网站可能提供由第三方提供的经销商服务和车辆定位服务。为了有效提供距您当时地点最近的供应商，我们可能会搜集您的IP地址以确认您的位置，我们也能请您提供如邮政编码、城市省份的位置信息。若我们需要通过第三方提供供应商定位服务的话，我们也会为第三方合作伙伴提供邮政编码的信息。

若您在本网站上使用搜索功能，您即同意遵守搜索服务方的条款/隐私政策。如，当您使用必应功能时，您需遵守微软服务条款和微软在线隐私声明。另外，若您在浏览手机网站同时开启了手机（若有）的GPS功能的话，您的GPS数据可能被搜索功能调用，以此来确认您的位置并提供定位服务。</p>
        </div>
      </div>
    </div>
  </div>
</template>
<script>
  import {
    Group,
    Cell,
    } from 'vux'
  import BScroll from "better-scroll";
import { setTimeout } from 'timers';
  export default {
    name: "",
    components: {
      Group,
      Cell,
      BScroll
    },
    data(){
      return {
        refash:true,
      }
    },
    props:{
      show:Boolean,
    },
    watch:{
      show:function(){
        if(this.refash){
          this.contentMain = new BScroll(this.$refs.contentMain, {
              // scrollX: true,
              // eventPassthrough: 'vertical',
              probeType: 3,
              // momentum: false,
              // bounce: false,
              click:true,
          })
          this.refash = false;
        }
      }
    },
    methods:{
      closeDialog(){
         //给父组件传参
         this.$emit('closeDialog',false)
      },
    },
    mounted() {
    }
  }
</script>
 
<style lang="sass" scoped>
    .border {
        font-family: lincolnproxima,Arial,Microsoft Yahei;
        .title {
            font-weight: 700;
            font-size: 24px;
            color: #000;
            text-align:center;
            padding:15px;
            margin-left: 40px;
        }
        .contentOut{
            height: 70vh;
            overflow: hidden;
            padding:15px;
          .content {
              >h4 {
                  text-align: center;
                  color: #000;
                  font-size: 20px;
                  font-weight: 700;
                  line-height: 1.5;
                  margin-top:0;
                  margin-bottom: .5em;
              }
              >p {
                  color: #4f4c43;
                  font-size: 12px;
                  line-height: 1.5;
                  margin-top: 0;
                  margin-bottom: 1em;
                  text-align: justify;
              }
              .tip {
                  color: #000;
                  font-size: 12px;
                  line-height: 1.5;
              }
              .last-p-padding {
                padding-bottom:30px;
              }
          }
        }
    }
</style>